import React, { useState } from "react";
import "../assets/styles/MainPart.css";
import Messages from "./Messages";
import SendMessage from "./SendMessage";
import TopBar from "./TopBar";

const MainPart = () => {
  const [messages, setMessages] = useState([
    {
      message: "fdfadaddasgffdas",
      time: "03:11 pm",
      isFrom: true,
    },
    {
      message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
      time: "03:11 pm",
      isFrom: false,
    },
    {
      message: "fdfadaddasgffdas",
      time: "03:12 am",
      isFrom: true,
    },
    {
      message: "fdfadaddasgffdas",
      time: "03:11 pm",
      isFrom: false,
    },
    {
      message:
        "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
      time: "03:21 pm",
      isFrom: false,
    },
    {
      message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
      time: "03:11 pm",
      isFrom: false,
    },
    {
      message: "fdfadaddasgffdas",
      time: "03:12 am",
      isFrom: true,
    },
    {
      message: "fdfadaddasgffdas",
      time: "03:11 pm",
      isFrom: false,
    },
    {
      message:
        "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
      time: "03:21 pm",
      isFrom: false,
    },
  ]);

  return (
    <div className="main-part">
      <TopBar />

      <Messages messages={messages} />

      <SendMessage setMessages={setMessages} messages={messages} />
    </div>
  );
};

export default MainPart;
